spec/cassettes/Checking_Out_via_Purchase_Order/clearing_the_cart_during_checkout_preview.yml

---
http_interactions:
- request:
    method: post
    uri: https://ak-test-2nUrWp1vUFJ9T17cN1sbKBGvue3lZkHmE:@api.balancedpayments.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"name":"Organization 2","meta":{"entity_id":1,"entity_name":"Organization
        2","entity_type":"organization"}}'
    headers:
      User-Agent:
      - balanced-ruby/0.8.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Mon, 11 May 2015 14:40:35 GMT
      Location:
      - http://bapi-integration-prod-8u30f7.us-west-1.vandelay.io/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMaee0f560f7eb11e482d002a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP4X7mSSQwAyDzwUfc5TAQ7D
      X-Balanced-Merchant:
      - TEST-MR4RZnrOZZQznEBncFS5xnVS
      X-Balanced-Revision:
      - '1.0'
      X-Balanced-Software-Build:
      - 1.14.28
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSQhUQXltWEBVNAUIHWRZdGhgSA0kZUR9TBFtUAAFRXlYAAgVQU1sAHRdXVAkaE0BVVQYIUVpWCQkGUQYACQAFQx9CAldbEgM+
      Content-Length:
      - '1714'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "_type": "customer",
          "twitter": null,
          "reversals_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/reversals",
          "phone": null,
          "meta": {
            "entity_id": "1",
            "entity_name": "Organization 2",
            "entity_type": "organization"
          },
          "facebook": null,
          "address": {},
          "business_name": null,
          "bank_accounts_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/bank_accounts",
          "id": "CU5k2tKNxvg9DFpl5WsSprkA",
          "credits_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/credits",
          "cards_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/cards",
          "holds_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/holds",
          "name": "Organization 2",
          "refunds_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/refunds",
          "dob": null,
          "created_at": "2015-05-11T14:47:13.035809Z",
          "destination": null,
          "is_identity_verified": false,
          "uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA",
          "source": null,
          "_uris": {
            "transactions_uri": {
              "_type": "page",
              "key": "transactions"
            },
            "bank_accounts_uri": {
              "_type": "page",
              "key": "bank_accounts"
            },
            "refunds_uri": {
              "_type": "page",
              "key": "refunds"
            },
            "debits_uri": {
              "_type": "page",
              "key": "debits"
            },
            "holds_uri": {
              "_type": "page",
              "key": "holds"
            },
            "reversals_uri": {
              "_type": "page",
              "key": "reversals"
            },
            "credits_uri": {
              "_type": "page",
              "key": "credits"
            },
            "cards_uri": {
              "_type": "page",
              "key": "cards"
            }
          },
          "debits_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/debits",
          "transactions_uri": "/v1/customers/CU5k2tKNxvg9DFpl5WsSprkA/transactions",
          "ssn_last4": null,
          "email": null,
          "ein": null
        }
    http_version: 
  recorded_at: Mon, 05 May 2014 04:00:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: description=Organization%208&metadata[lo.entity_id]=1&metadata[lo.entity_type]=organization
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Mels-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Mels-MBP"}'
      Content-Length:
      - '91'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 29 Jul 2015 17:05:13 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '909'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6hMiUPuVtObVEE
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1438189513,
          "id": "cus_6hMifzXQyTqkvc",
          "livemode": false,
          "description": "Organization 8",
          "email": null,
          "delinquent": false,
          "metadata": {
            "lo.entity_id": "1",
            "lo.entity_type": "organization"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6hMifzXQyTqkvc/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "bank_accounts": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6hMifzXQyTqkvc/bank_accounts",
            "data": []
          },
          "default_bank_account": null,
          "default_source_type": null,
          "sources": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6hMifzXQyTqkvc/sources",
            "data": []
          },
          "default_source": null
        }
    http_version: 
  recorded_at: Mon, 05 May 2014 04:00:03 GMT
recorded_with: VCR 2.9.3
