spec/cassettes/Checking_Out_via_Purchase_Order/with_discount/over_the_whole_order/less_then_the_order_total/persists_the_discount_on_the_order.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: description=Organization%206365&metadata[lo_entity_id]=3&metadata[lo_entity_type]=organization&metadata[lo_entity_name]=Organization%206365
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.2
      Authorization:
      - Bearer sk_test_KagdXeHZHHOHNrXETSTkPuX6
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.2","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin17.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        kite 17.4.0 Darwin Kernel Version 17.4.0: Sun Dec 17 09:19:54 PST 2017; root:xnu-4570.41.2~1/RELEASE_X86_64
        x86_64","hostname":"kite"}'
      Content-Length:
      - '139'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 10 Mar 2018 00:01:12 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '774'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Av0AMa72kHWdsA
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_CSqqqcoAKfDZDI",
          "object": "customer",
          "account_balance": 0,
          "created": 1520640072,
          "currency": null,
          "default_source": null,
          "delinquent": false,
          "description": "Organization 6365",
          "discount": null,
          "email": null,
          "invoice_prefix": "1434F01",
          "livemode": false,
          "metadata": {
            "lo_entity_id": "3",
            "lo_entity_type": "organization",
            "lo_entity_name": "Organization 6365"
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CSqqqcoAKfDZDI/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CSqqqcoAKfDZDI/subscriptions"
          }
        }
    http_version: 
  recorded_at: Mon, 05 May 2014 07:00:04 GMT
recorded_with: VCR 4.0.0
