spec/cassettes/Checking_Out_via_Purchase_Order/with_discount/over_the_whole_order/more_than_order_total/persists_the_discount_on_the_order.yml

---
http_interactions:
- request:
    method: post
    uri: https://ak-test-2nUrWp1vUFJ9T17cN1sbKBGvue3lZkHmE:@api.balancedpayments.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"name":"Organization 16","meta":{"entity_id":1,"entity_name":"Organization
        16","entity_type":"organization"}}'
    headers:
      User-Agent:
      - balanced-ruby/0.8.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Mon, 11 May 2015 14:41:42 GMT
      Location:
      - http://bapi-integration-prod-8u30f7.us-west-1.vandelay.io/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMd6ff47a4f7eb11e4b84c02a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP4X7mSSQwAyDzwUfc5TAQ7D
      X-Balanced-Merchant:
      - TEST-MR4RZnrOZZQznEBncFS5xnVS
      X-Balanced-Revision:
      - '1.0'
      X-Balanced-Software-Build:
      - 1.14.28
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSQhUQXltWEBVNAUIHWRZdGhgSA0kZUR9TAFpVDgRYUVYKAglTU1QCBxtGVQAGH0JEUlAABF5VXgAFUQMBWlMDABFORFBWDRUGZQ==
      Content-Length:
      - '1716'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "_type": "customer",
          "twitter": null,
          "reversals_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/reversals",
          "phone": null,
          "meta": {
            "entity_id": "1",
            "entity_name": "Organization 16",
            "entity_type": "organization"
          },
          "facebook": null,
          "address": {},
          "business_name": null,
          "bank_accounts_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/bank_accounts",
          "id": "CU6xKbVJBdnjieDwVI0PhzMI",
          "credits_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/credits",
          "cards_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/cards",
          "holds_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/holds",
          "name": "Organization 16",
          "refunds_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/refunds",
          "dob": null,
          "created_at": "2015-05-11T14:48:20.346431Z",
          "destination": null,
          "is_identity_verified": false,
          "uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI",
          "source": null,
          "_uris": {
            "transactions_uri": {
              "_type": "page",
              "key": "transactions"
            },
            "bank_accounts_uri": {
              "_type": "page",
              "key": "bank_accounts"
            },
            "refunds_uri": {
              "_type": "page",
              "key": "refunds"
            },
            "debits_uri": {
              "_type": "page",
              "key": "debits"
            },
            "holds_uri": {
              "_type": "page",
              "key": "holds"
            },
            "reversals_uri": {
              "_type": "page",
              "key": "reversals"
            },
            "credits_uri": {
              "_type": "page",
              "key": "credits"
            },
            "cards_uri": {
              "_type": "page",
              "key": "cards"
            }
          },
          "debits_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/debits",
          "transactions_uri": "/v1/customers/CU6xKbVJBdnjieDwVI0PhzMI/transactions",
          "ssn_last4": null,
          "email": null,
          "ein": null
        }
    http_version: 
  recorded_at: Mon, 05 May 2014 04:00:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: description=Organization%2015&metadata[lo.entity_id]=1&metadata[lo.entity_type]=organization
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Mels-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Mels-MBP"}'
      Content-Length:
      - '92'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 29 Jul 2015 17:05:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '910'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6hMjZCCFYSONwR
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1438189545,
          "id": "cus_6hMjwnfJYuy8AF",
          "livemode": false,
          "description": "Organization 15",
          "email": null,
          "delinquent": false,
          "metadata": {
            "lo.entity_id": "1",
            "lo.entity_type": "organization"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6hMjwnfJYuy8AF/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "bank_accounts": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6hMjwnfJYuy8AF/bank_accounts",
            "data": []
          },
          "default_bank_account": null,
          "default_source_type": null,
          "sources": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6hMjwnfJYuy8AF/sources",
            "data": []
          },
          "default_source": null
        }
    http_version: 
  recorded_at: Mon, 05 May 2014 04:00:02 GMT
recorded_with: VCR 2.9.3
